{"data":{"site":{"siteMetadata":{"title":"Lecstor's Blog","author":"Jason Galea"}},"markdownRemark":{"id":"4cb6b79d-d9fb-50d8-b951-88f56d717409","excerpt":"My goal was to deploy a basic React app with a server backend to the Google\nCloud Platform. For learnings I decided to use Google Cloud…","html":"<p>My goal was to deploy a basic React app with a server backend to the Google\nCloud Platform.</p>\n<p>For learnings I decided to use Google Cloud Functions (which may also have been\nthe cheapest backend option).</p>\n<p>TL;DR this is not what Google Cloud Functions are intended for..</p>\n<h3 id=\"deploy-the-static-react-app\"><a href=\"#deploy-the-static-react-app\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Deploy the static React app</h3>\n<p>The recommended option is to host this in Google Cloud Storage as Browser\nstorage which gives the added benefit of being able to use a CDN with a click\non a checkbox.</p>\n<p>This was a fairly painless process involving creating the bucket named after my\ndomain name and creating a CNAME record pointing to it. Unfortunately this\ndoesn’t provide SSL.</p>\n<h3 id=\"set-up-a-load-balancer\"><a href=\"#set-up-a-load-balancer\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Set up a load balancer</h3>\n<p>A bit more finding my way around, but not too bad using the great documentation\navailable. The load balancer allowed me to add my domain and automatically add\na Let’s Encrypt SSL cert.</p>\n<p>With only an HTTPS endpoint set up, HTTP requests were denied so I added an HTTP\nendpoint. There’s currently no way to have the load balancer redirect from HTTP\nto HTTPS so I had to resort to adding a Javascript redirect snippet to my app\nindex.html to ensure HTTPS was always used.</p>\n<p>The load balancer can be set up to forward to a bucket backend, or a service\nbackend, but not Google Cloud functions. I had the choice of adding a service\nand setting up a proxy, or having my app to hit the cloud functions directly 8(.\nI opted for the latter for the reduced cost and complexity.</p>\n<h3 id=\"move-to-appengine-flexible\"><a href=\"#move-to-appengine-flexible\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Move to Appengine Flexible</h3>\n<p>At this point I reassessed things.. I had had thoughts of using websockets for\nlive updates on database changes and realised that that was never going to work\nwith GCF. I could add a service behind the load balancer and use it for\nwebsockets and at the same time solve the functions issue but then there didn’t\nseem to be enough benefit from maintaining the cloud functions as well as a\nservice so I opted to move everything to a service. Putting that service behind\nthe load balancer would then mean I would need to handle any scaling issues\nmyself.</p>\n<p>Appengine standard would potentially mean the service dissappeared at times,\nbreaking the websockets implementation so I opted for flexible. I could start\nwith a single service and easily increase that if ever needed.</p>\n<p>Unfortunately Appengine can’t be set up to serve static content from GCS without\ngoing through the service, so the service will be serving both static and dynamic\ncontent and I lose the CDN. On the plus side it’ll all be there if I ever decide\nserver-side rendering is the way to go..</p>\n<h3 id=\"summary\"><a href=\"#summary\" aria-hidden class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Summary</h3>\n<p>The Google Cloud Platform is very well documented, and there are many tutorials\navailable making it fairly easy to get things set up, as long as you follow the\nprescribed paths.</p>\n<p>I was surprised and disappointed by some of the limitations imposed such as the\nlack of redirection from HTTP to HTTPS and the inability of the load balancers\nto forward to cloud functions in one instance and cloud storage in the other.\nThe lack of HTTP/HTTPS redirection has an issue in the google bug tracker where\na fix was promised a few years ago.</p>\n<p>Ultimately I think the UI and documentation provided by Google is a refreshing\nchange to that offered by AWS. It’s still relatively young as a platform so it’s\nlikely that things will continue to improve. Hopefully the limitations are not\nconcious decisions to push people to use the more vendor specific services such\nas Firebase. Appengine itself has definitely come a long way since I last used\nit 7 years ago.</p>","frontmatter":{"title":"A Journey from Google Cloud Functions to Appengine Flex","date":"February 26, 2019"}}},"pageContext":{"slug":"/gcf-to-appengine/","previous":{"fields":{"slug":"/kafka-cheatsheet/"},"frontmatter":{"title":"Kafka/Protobuf Cheatsheet"}},"next":null}}