{"data":{"site":{"siteMetadata":{"title":"Personal Musings by Lecstor","author":"Jason Galea"}},"markdownRemark":{"id":"639c8957-ff69-504c-ad39-a96879c13bf9","excerpt":"Adobe’s Portable Document Format (PDF) files have almost become the standard for preparing well-formatted documents. There are PDF readers…","html":"<blockquote>\n<p>Adobe’s Portable Document Format (PDF) files have almost become the standard for preparing well-formatted documents. There are PDF readers/displayers for most web browsers, so there is no real excuse for not providing this kind of formatted document to your users if your web application demands its use. Standardized forms and statistical reports can all be drawn from a web system’s data, so it makes sense to format that data in a common layout. <a href=\"http://people.oreilly.com/adfm\">Adam Flaherty</a></p>\n</blockquote>\n<p>Example uses for dynamically generated PDFs include orders, receipts, invoices, packing slips, event tickets, reports, certificates, booking details and anything else that would benefit from a well supported printable document format that can easily be sent to others and stored for archival purposes.</p>\n<p>I created (and continue to develop) <a href=\"https://docca.io\">Docca</a> as a web service to ease the pain of implementing dynamic PDF files from your web site or service. Docca uses bespoke layout and PDF engines to generate documents from XML based document source generated by combining JSON data and applicable templates.</p>\n<p>In researching the challenges inherent in PDF generation and the solutions available I gathered together some related articles and the libraries they use. I hope this might help you to get up to speed quickly and find the best solution for your situation.</p>\n<h2>Articles</h2>\n<p><a href=\"http://rick.measham.id.au/pdf-api2/\">Using PDF::API2</a>\n<em>A Tutorial by Example - This document is designed to teach you to drive PDF::API2, the most comprehensive toolkit for creating PDF files from Perl. It wont teach you PDF. If you want to learn PDF, Adobe have the full specification available for download on their website.</em></p>\n<p><a href=\"http://lukesthoughtdump.blogspot.com.au/2010/05/pdfapi2-is-underrated.html\">PDF::API2 is Underrated</a>\n<em>This is by no means a tutorial, or even an introduction to PDF::API2 … this is more of a coredump of the part of my brain that knows PDF, so to speak.</em></p>\n<p><a href=\"https://docs.djangoproject.com/en/dev/howto/outputting-pdf/\">Outputting PDFs with Django</a>\n<em>This document explains how to output PDF files dynamically using Django views. This is made possible by the excellent, open-source ReportLab Python PDF library.</em></p>\n<p><a href=\"http://answers.oreilly.com/topic/1414-how-to-generate-a-pdf-with-php/\">How to Generate a PDF With PHP</a>\n<em>Creating a PDF with PHP can be relatively straightforward. However, knowing what library to use and how to deal with errors can help you cut back on the tedious work associated with generating a PDF.</em></p>\n<p><a href=\"http://viget.com/extend/how-to-create-pdfs-in-rails\">How To Create PDFs in Rails</a>\n<em>We worked with The Bill of Rights Institute recently to create an interactive digital course for American History teachers. One of the interesting challenges, among many, stemmed from the fact that the project had large sections of readable content. One of our goals was to make it easy for students and teachers to print out their reading material if and when they’re not able to read it on screen.</em></p>\n<p><a href=\"https://shellycloud.com/blog/2014/01/generating-pdfs-with-custom-fonts-using-wkhtmltopdf\">Generating PDFs with custom fonts using wkhtmltopdf</a>\n<em>Generating PDF files with custom fonts can be tricky. In this tutorial we will create a simple Rails app and tackle this problem with two tools: wicked</em>pdf and wkhtmltopdf._</p>\n<p><a href=\"http://newexception.com/html-to-pdf-php\">Generate PDF from HTML using wkhtmltopdf and PHP</a>\n<em>God knows what i have tried in order to generate PDF files using php. I tried the FPDF and TCPDF library. Yes, it was easy to create simple tables, but when i came to the part which involves adding images into tables it was huge pain. I could not generate the desired layout until i found a great utility called wkhtmltopdf.</em></p>\n<p><a href=\"http://www.yiiframework.com/wiki/529/create-generate-pdf-files-with-tcpdf-plugin-example-to-generate-table-with-tcpdf-plugin/\">Create / Generate PDF files with TCPDF plugin</a>\n<em>Few days ago i was playing with TCPF plugin to create a PDF files. Since i have checked few available extension and also checked some forum threads but still i dont get my expected result for PDF file.</em></p>\n<h2>Libraries</h2>\n<ul>\n<li><a href=\"https://metacpan.org/release/PDF-API2\">PDF::API2</a> (Perl)</li>\n<li><a href=\"http://www.reportlab.com/opensource/\">ReportLab open-source PDF Toolkit</a> (Python)</li>\n<li><a href=\"https://github.com/prawnpdf/prawn\">Prawn</a> (Ruby)</li>\n<li><a href=\"https://github.com/pdfkit/pdfkit\">pdfkit</a> (Ruby)</li>\n<li><a href=\"https://github.com/mileszs/wicked_pdf\">wicked_pdf</a> (Ruby)</li>\n<li><a href=\"http://fpdf.org/\">FPDF</a> (PHP)</li>\n<li><a href=\"http://www.tcpdf.org/\">TCPDF</a> (PHP)</li>\n<li><a href=\"http://parall.ax/products/jspdf\">jsPDF</a> (Javascript)</li>\n<li><a href=\"http://www.princexml.com/\">Prince</a> (Javascript)</li>\n<li><a href=\"http://wkhtmltopdf.org/\">wkhtmltopdf</a> (command line)</li>\n</ul>","frontmatter":{"title":"How to create PDF documents","date":"April 21, 2014"}}},"pageContext":{"slug":"/how-to-create-pdf-documents/","previous":{"fields":{"slug":"/something-about-perl/"},"frontmatter":{"title":"Something about Perl"}},"next":{"fields":{"slug":"/mongodb-upgrade-24-to-26-in-debian/"},"frontmatter":{"title":"MongoDB Upgrade 2.4 to 2.6 in Debian"}}}}